{"e30cfeba-c751-4dbb-a350-1209acd960e1":{"name":"BepInEx","description":"Bepis Injector Extensible"},"4df25152-dc91-4b31-bfa4-904447a02a85":{"name":"BGMLoader","description":"Loads custom BGMs and clips played on game startup. Stock audio is replaced during runtime by custom clips from BepInEx\\BGM and BepInEx\\IntroClips directories"},"54daee20-d190-42ff-9756-438798cec16c":{"name":"ColorCorrector","description":"Allows configuration of some post-processing filters. (change of bloom amount, disable saturation filter)"},"c3db40bf-d97d-4cd4-859c-9dd453f5e789":{"name":"BepInEx.ConfigurationManager","description":"Mod configuration manager for BepInEx 5"},"1885f293-ed59-4ec2-8746-14625a9c2ab3":{"name":"BetterHScenes","description":"This plugin fixes HScene performance bugs and adds extra features"},"1b4bb2d6-87e2-45fa-aee7-a27bba9f5342":{"name":"HCharaSwitcher","description":"This plugin allows you to change character cards during H scene"},"fd363547-ea54-4db1-a08c-b13a1ae64542":{"name":"BrowserFolders","description":"Maker and Studio File Browser Folders for games by Illusion"},"ebda00ee-be52-4115-81db-810cfd329044":{"name":"CameraTargetFix","description":"Hides the cursor when the camera target is disabled in Studio. In AI Girl, also makes the camera target option in the game settings work properly for the character maker"},"2e1d8799-f202-41c5-a600-d743e7db0d4a":{"name":"CardImport","description":"Prevents the game from crashing or stripping some modded data when importing KK cards"},"8cd3047a-36ad-47d7-89ce-a6df64ec7763":{"name":"CharacterListOptimizations","description":"Makes character lists load faster"},"76c3d68a-e284-43db-acdc-23178bac7302":{"name":"CenteredHSceneCursor","description":"Fixes the cursor texture not being properly centeres in H scenes, so it's easier to click on things"},"2c6bcee3-5a8e-4720-a2ca-3363f96c3401":{"name":"DownloadRenamer","description":"Maps, scenes, poses, and characters downloaded in game will have their file names changed to match the ones on the Illusion website"},"c5b1197c-efe3-43f5-b06d-d7b81a1a1647":{"name":"ExpandShaderDropdown","description":"Makes the shader drop down menu extend down instaed of up and expands it. Necessary to select modded shaders since they run off the screen by default"},"07617ca7-cf7d-4338-b96f-c18ca4c9bd36":{"name":"HeterochromiaFix","description":"Allows you to load characters with different iris types without them being reset"},"44c1f320-804f-4d0f-9558-ca4ce164b377":{"name":"InvalidSceneFileProtection","description":"Adds error handling to scene loading and importing. If a scene is invalid or from the wrong game version then a message is shown and the studio doesn't crash"},"dee878c1-9b79-4375-9731-b8b6ae3bb1ff":{"name":"MainGameOptimizations","description":"Multiple performance optimizations for the story mode. Aimed to reduce stutter and random FPS drops"},"a5f42f00-db29-4ff7-a75a-00f9f1eda344":{"name":"MakerOptimizations","description":"Multiple performance optimizations for the character maker. Can greatly increase FPSMultiple performance optimizations for the character maker. Can greatly increase FPS, makes turning on/off the interface in maker by pressing space much faster (after the 1st press), and more"},"4c021cfb-f769-42ea-af4a-33a0a0e6d00d":{"name":"ManifestCorrector","description":"Prevents mods that use incorrect data in the MainManifest column of item lists from locking up the game in story mode"},"30d58598-35bb-434c-91bc-798633c50f90":{"name":"ModdedHeadEyeliner","description":"Fixes modded head eyeliners not working on other head types than default"},"14ac8f39-f630-4daf-9e88-9770d1cac8f2":{"name":"NewGameShowAllCards","description":"Fixes downloaded character cards not appearing in the New Game character selection (so you don't have to go to maker and re-save them)"},"40ca1340-02c8-42b3-8b1c-e916d453c5e9":{"name":"NodeEditorUnlock","description":""},"8b50ef00-ff1e-4df9-8ab1-6743e6202e08":{"name":"NullChecks","description":"Fixes for some questionably made mods causing issues"},"c5f3f32f-6634-4a5d-b9a0-2c1fdf735353":{"name":"PartyCardCompatibility","description":"Allows loading of cards saved in Koikatsu Party (Steam release) in Koikatu and Studio"},"ae846d66-4039-4c55-aeec-5090e0c8cc17":{"name":"PersonalityCorrector","description":"Prevents cards with invalid or missing personalities from crashing the game. A default personality is set instead"},"0416e7f0-61b7-4ce4-8dee-b98ce79d0df1":{"name":"PoseLoad","description":"Corrects Honey Select poses loaded in Koikatsu and prevents errors"},"f7c9fd40-c737-4979-88db-9ded570a2a00":{"name":"ResourceUnloadOptimizations","description":"Improves loading times and eliminates stutter after loading was \"finished\""},"f6205520-177d-4db5-8680-6fa028934057":{"name":"SettingsVerifier","description":"Prevents corrupted setting from causing issues and forces studio to use the settings.xml file instead of registry"},"ae1403dc-a9cd-4832-aff1-7fc08c3ede98":{"name":"ShowerAccessories","description":"Prevents accessories from being removed in shower peeping mode. No more gaping holes in the head when using hair accessories"},"a46a1305-55e3-4d8b-8090-558d654d80da":{"name":"UnlimitedMapLights","description":"Allows using an unlimited amount of map lights in studio. Not all items support more than 3 lights"},"f4bddb9d-308f-4c06-b59a-20d80277ed6c":{"name":"SteamReleaseCompatibility","description":"Allows using plugins made for the Japanese release of the game, and makes it possible to use Studio"},"cde02419-a4ea-428c-b98d-d7efc5bbd272":{"name":"LogDespammerPlugin","description":""},"66365308-bb1e-4a54-aea8-056b7a753e43":{"name":"CultureFix","description":"Set process culture to ja-JP, similarly to a locale emulator. Fixes game crashes and lockups on some system locales"},"41567941-3f02-4802-a5b9-f214bcf35fa6":{"name":"MagicCarrot","description":"Prevents the game from locking up when starting"},"4b1fb4d9-cd19-42ce-9ac1-2018ef1e631f":{"name":"UnlockPlayerHeight","description":"This plugin unlocks the players (or male chara) height hard lock of 75 and adds a male height slider to the maker"}}